{"format": "graph-model", "generatedBy": "2.4.1", "convertedBy": "TensorFlow.js Converter v3.18.0", "signature": {"outputs": {"dense_out": {"name": "dense_out"}}}, "modelTopology": {"node": [{"name": "onnx_tf_prefix_flatten_in/strided_slice/stack", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_INT32", "tensorShape": {"dim": [{"size": "1"}]}}}, "dtype": {"type": "DT_INT32"}}}, {"name": "onnx_tf_prefix_flatten_in/strided_slice/stack_1", "op": "Const", "attr": {"dtype": {"type": "DT_INT32"}, "value": {"tensor": {"dtype": "DT_INT32", "tensorShape": {"dim": [{"size": "1"}]}}}}}, {"name": "onnx_tf_prefix_flatten_in/strided_slice/stack_2", "op": "Const", "attr": {"dtype": {"type": "DT_INT32"}, "value": {"tensor": {"dtype": "DT_INT32", "tensorShape": {"dim": [{"size": "1"}]}}}}}, {"name": "onnx_tf_prefix_flatten_in/Reshape/shape/1", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_INT32", "tensorShape": {}}}, "dtype": {"type": "DT_INT32"}}}, {"name": "onnx_tf_prefix_batch_normalization/mul", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "1"}, {"size": "200"}]}}}, "dtype": {"type": "DT_FLOAT"}}}, {"name": "onnx_tf_prefix_batch_normalization/sub", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "1"}, {"size": "200"}]}}}, "dtype": {"type": "DT_FLOAT"}}}, {"name": "dense_out/kernel_tf_0_cb059fca", "op": "Const", "attr": {"dtype": {"type": "DT_FLOAT"}, "value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "200"}, {"size": "2"}]}}}}}, {"name": "dense_out/bias_tf_0_36efc7f2", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "2"}]}}}, "dtype": {"type": "DT_FLOAT"}}}, {"name": "flatten_in_input", "op": "Placeholder", "attr": {"dtype": {"type": "DT_FLOAT"}, "shape": {"shape": {"dim": [{"size": "-1"}, {"size": "1"}, {"size": "200"}]}}}}, {"name": "onnx_tf_prefix_flatten_in/Shape", "op": "Shape", "input": ["flatten_in_input"], "attr": {"out_type": {"type": "DT_INT32"}, "T": {"type": "DT_FLOAT"}}}, {"name": "onnx_tf_prefix_flatten_in/strided_slice", "op": "StridedSlice", "input": ["onnx_tf_prefix_flatten_in/Shape", "onnx_tf_prefix_flatten_in/strided_slice/stack", "onnx_tf_prefix_flatten_in/strided_slice/stack_1", "onnx_tf_prefix_flatten_in/strided_slice/stack_2"], "attr": {"ellipsis_mask": {"i": "0"}, "new_axis_mask": {"i": "0"}, "shrink_axis_mask": {"i": "1"}, "T": {"type": "DT_INT32"}, "begin_mask": {"i": "0"}, "Index": {"type": "DT_INT32"}, "end_mask": {"i": "0"}}}, {"name": "onnx_tf_prefix_flatten_in/Reshape/shape", "op": "Pack", "input": ["onnx_tf_prefix_flatten_in/strided_slice", "onnx_tf_prefix_flatten_in/Reshape/shape/1"], "attr": {"N": {"i": "2"}, "axis": {"i": "0"}, "T": {"type": "DT_INT32"}}}, {"name": "onnx_tf_prefix_flatten_in/Reshape", "op": "Reshape", "input": ["flatten_in_input", "onnx_tf_prefix_flatten_in/Reshape/shape"], "attr": {"Tshape": {"type": "DT_INT32"}, "T": {"type": "DT_FLOAT"}}}, {"name": "onnx_tf_prefix_batch_normalization/mul_1", "op": "Mul", "input": ["onnx_tf_prefix_flatten_in/Reshape", "onnx_tf_prefix_batch_normalization/mul"], "attr": {"T": {"type": "DT_FLOAT"}}}, {"name": "onnx_tf_prefix_batch_normalization/add_1", "op": "AddV2", "input": ["onnx_tf_prefix_batch_normalization/mul_1", "onnx_tf_prefix_batch_normalization/sub"], "attr": {"T": {"type": "DT_FLOAT"}}}, {"name": "onnx_tf_prefix_dense_out", "op": "MatMul", "input": ["onnx_tf_prefix_batch_normalization/add_1", "dense_out/kernel_tf_0_cb059fca"], "device": "/device:CPU:0", "attr": {"T": {"type": "DT_FLOAT"}, "transpose_b": {"b": false}, "transpose_a": {"b": false}}}, {"name": "dense_out", "op": "Add", "input": ["onnx_tf_prefix_dense_out", "dense_out/bias_tf_0_36efc7f2"], "attr": {"T": {"type": "DT_FLOAT"}}}], "library": {}, "versions": {"producer": 134}}, "weightsManifest": [{"paths": ["group1-shard1of1.bin"], "weights": [{"name": "onnx_tf_prefix_flatten_in/strided_slice/stack", "shape": [1], "dtype": "int32"}, {"name": "onnx_tf_prefix_flatten_in/strided_slice/stack_1", "shape": [1], "dtype": "int32"}, {"name": "onnx_tf_prefix_flatten_in/strided_slice/stack_2", "shape": [1], "dtype": "int32"}, {"name": "onnx_tf_prefix_flatten_in/Reshape/shape/1", "shape": [], "dtype": "int32"}, {"name": "onnx_tf_prefix_batch_normalization/mul", "shape": [1, 200], "dtype": "float32"}, {"name": "onnx_tf_prefix_batch_normalization/sub", "shape": [1, 200], "dtype": "float32"}, {"name": "dense_out/kernel_tf_0_cb059fca", "shape": [200, 2], "dtype": "float32"}, {"name": "dense_out/bias_tf_0_36efc7f2", "shape": [2], "dtype": "float32"}]}]}