{"format": "graph-model", "generatedBy": "2.1.0", "convertedBy": "TensorFlow.js Converter v1.7.2", "userDefinedMetadata": {"signature": {"outputs": {"model/Sigmoid": {"name": "model/Sigmoid"}}}}, "modelTopology": {"node": [{"name": "model/batch_normalization_10/batchnorm/mul", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "200"}]}}}, "dtype": {"type": "DT_FLOAT"}}}, {"name": "model/batch_normalization_9/batchnorm/mul", "op": "Const", "attr": {"dtype": {"type": "DT_FLOAT"}, "value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "1506"}]}}}}}, {"name": "model/Max/reduction_indices", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_INT32", "tensorShape": {}}}, "dtype": {"type": "DT_INT32"}}}, {"name": "conv2d/kernel", "op": "Const", "attr": {"dtype": {"type": "DT_FLOAT"}, "value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "7"}, {"size": "38"}, {"size": "1"}, {"size": "204"}]}}}}}, {"name": "conv2d/bias", "op": "Const", "attr": {"dtype": {"type": "DT_FLOAT"}, "value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "204"}]}}}}}, {"name": "conv2d_1/kernel", "op": "Const", "attr": {"dtype": {"type": "DT_FLOAT"}, "value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "7"}, {"size": "67"}, {"size": "1"}, {"size": "204"}]}}}}}, {"name": "conv2d_1/bias", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "204"}]}}}, "dtype": {"type": "DT_FLOAT"}}}, {"name": "conv2d_2/kernel", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "128"}, {"size": "1"}, {"size": "1"}, {"size": "51"}]}}}, "dtype": {"type": "DT_FLOAT"}}}, {"name": "conv2d_2/bias", "op": "Const", "attr": {"dtype": {"type": "DT_FLOAT"}, "value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "51"}]}}}}}, {"name": "conv2d_3/kernel", "op": "Const", "attr": {"dtype": {"type": "DT_FLOAT"}, "value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "64"}, {"size": "1"}, {"size": "1"}, {"size": "51"}]}}}}}, {"name": "conv2d_3/bias", "op": "Const", "attr": {"dtype": {"type": "DT_FLOAT"}, "value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "51"}]}}}}}, {"name": "model/Placeholder", "op": "Placeholder", "attr": {"dtype": {"type": "DT_FLOAT"}, "shape": {"shape": {"dim": [{"size": "-1"}, {"size": "187"}, {"size": "96"}]}}}}, {"name": "conv2d_4/kernel", "op": "Const", "attr": {"dtype": {"type": "DT_FLOAT"}, "value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "32"}, {"size": "1"}, {"size": "1"}, {"size": "51"}]}}}}}, {"name": "conv2d_4/bias", "op": "Const", "attr": {"dtype": {"type": "DT_FLOAT"}, "value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "51"}]}}}}}, {"name": "model/ExpandDims/dim", "op": "Const", "attr": {"dtype": {"type": "DT_INT32"}, "value": {"tensor": {"dtype": "DT_INT32", "tensorShape": {}}}}}, {"name": "model/batch_normalization_4/FusedBatchNormV3/Scaled", "op": "Const", "attr": {"dtype": {"type": "DT_FLOAT"}, "value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "51"}]}}}}}, {"name": "conv2d_5/kernel", "op": "Const", "attr": {"dtype": {"type": "DT_FLOAT"}, "value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "7"}, {"size": "561"}, {"size": "1"}, {"size": "64"}]}}}}}, {"name": "conv2d_5/bias", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "64"}]}}}, "dtype": {"type": "DT_FLOAT"}}}, {"name": "conv2d_6/kernel", "op": "Const", "attr": {"dtype": {"type": "DT_FLOAT"}, "value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "7"}, {"size": "64"}, {"size": "1"}, {"size": "64"}]}}}}}, {"name": "conv2d_6/bias", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "64"}]}}}, "dtype": {"type": "DT_FLOAT"}}}, {"name": "model/Pad_3/paddings", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_INT32", "tensorShape": {"dim": [{"size": "4"}, {"size": "2"}]}}}, "dtype": {"type": "DT_INT32"}}}, {"name": "model/batch_normalization_4/FusedBatchNormV3/Offset", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "51"}]}}}, "dtype": {"type": "DT_FLOAT"}}}, {"name": "conv2d_7/kernel", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "7"}, {"size": "64"}, {"size": "1"}, {"size": "64"}]}}}, "dtype": {"type": "DT_FLOAT"}}}, {"name": "conv2d_7/bias", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "64"}]}}}, "dtype": {"type": "DT_FLOAT"}}}, {"name": "model/transpose_2/perm", "op": "Const", "attr": {"dtype": {"type": "DT_INT32"}, "value": {"tensor": {"dtype": "DT_INT32", "tensorShape": {"dim": [{"size": "4"}]}}}}}, {"name": "model/concat/axis", "op": "Const", "attr": {"dtype": {"type": "DT_INT32"}, "value": {"tensor": {"dtype": "DT_INT32", "tensorShape": {}}}}}, {"name": "model/batch_normalization_3/FusedBatchNormV3/Scaled", "op": "Const", "attr": {"dtype": {"type": "DT_FLOAT"}, "value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "51"}]}}}}}, {"name": "model/batch_normalization_3/FusedBatchNormV3/Offset", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "51"}]}}}, "dtype": {"type": "DT_FLOAT"}}}, {"name": "model/flatten/strided_slice/stack", "op": "Const", "attr": {"dtype": {"type": "DT_INT32"}, "value": {"tensor": {"dtype": "DT_INT32", "tensorShape": {"dim": [{"size": "1"}]}}}}}, {"name": "model/moments/mean/reduction_indices", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_INT32", "tensorShape": {"dim": [{"size": "1"}]}}}, "dtype": {"type": "DT_INT32"}}}, {"name": "model/flatten/Reshape/shape/1", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_INT32", "tensorShape": {}}}, "dtype": {"type": "DT_INT32"}}}, {"name": "model/batch_normalization_9/batchnorm/sub", "op": "Const", "attr": {"dtype": {"type": "DT_FLOAT"}, "value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "1506"}]}}}}}, {"name": "dense/kernel", "op": "Const", "attr": {"dtype": {"type": "DT_FLOAT"}, "value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "1506"}, {"size": "200"}]}}}}}, {"name": "dense/bias", "op": "Const", "attr": {"dtype": {"type": "DT_FLOAT"}, "value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "200"}]}}}}}, {"name": "model/batch_normalization/FusedBatchNormV3/Scaled", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "1"}]}}}, "dtype": {"type": "DT_FLOAT"}}}, {"name": "model/batch_normalization_10/batchnorm/sub", "op": "Const", "attr": {"dtype": {"type": "DT_FLOAT"}, "value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "200"}]}}}}}, {"name": "dense_1/kernel", "op": "Const", "attr": {"dtype": {"type": "DT_FLOAT"}, "value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "200"}, {"size": "100"}]}}}}}, {"name": "dense_1/bias", "op": "Const", "attr": {"dtype": {"type": "DT_FLOAT"}, "value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "100"}]}}}}}, {"name": "dense_2/kernel", "op": "Const", "attr": {"dtype": {"type": "DT_FLOAT"}, "value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "100"}, {"size": "2"}]}}}}}, {"name": "model/batch_normalization/FusedBatchNormV3/Offset", "op": "Const", "attr": {"dtype": {"type": "DT_FLOAT"}, "value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "1"}]}}}}}, {"name": "dense_2/bias", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "2"}]}}}, "dtype": {"type": "DT_FLOAT"}}}, {"name": "model/batch_normalization_8/FusedBatchNormV3/Scaled", "op": "Const", "attr": {"dtype": {"type": "DT_FLOAT"}, "value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "64"}]}}}}}, {"name": "model/batch_normalization_8/FusedBatchNormV3/Offset", "op": "Const", "attr": {"dtype": {"type": "DT_FLOAT"}, "value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "64"}]}}}}}, {"name": "model/batch_normalization_7/FusedBatchNormV3/Scaled", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "64"}]}}}, "dtype": {"type": "DT_FLOAT"}}}, {"name": "model/batch_normalization_7/FusedBatchNormV3/Offset", "op": "Const", "attr": {"dtype": {"type": "DT_FLOAT"}, "value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "64"}]}}}}}, {"name": "model/batch_normalization_6/FusedBatchNormV3/Scaled", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "64"}]}}}, "dtype": {"type": "DT_FLOAT"}}}, {"name": "model/batch_normalization_6/FusedBatchNormV3/Offset", "op": "Const", "attr": {"dtype": {"type": "DT_FLOAT"}, "value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "64"}]}}}}}, {"name": "model/batch_normalization_2/FusedBatchNormV3/Scaled", "op": "Const", "attr": {"dtype": {"type": "DT_FLOAT"}, "value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "204"}]}}}}}, {"name": "model/batch_normalization_2/FusedBatchNormV3/Offset", "op": "Const", "attr": {"dtype": {"type": "DT_FLOAT"}, "value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "204"}]}}}}}, {"name": "model/batch_normalization_1/FusedBatchNormV3/Scaled", "op": "Const", "attr": {"dtype": {"type": "DT_FLOAT"}, "value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "204"}]}}}}}, {"name": "model/batch_normalization_1/FusedBatchNormV3/Offset", "op": "Const", "attr": {"dtype": {"type": "DT_FLOAT"}, "value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "204"}]}}}}}, {"name": "model/batch_normalization_5/FusedBatchNormV3/Scaled", "op": "Const", "attr": {"dtype": {"type": "DT_FLOAT"}, "value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "51"}]}}}}}, {"name": "model/batch_normalization_5/FusedBatchNormV3/Offset", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "51"}]}}}, "dtype": {"type": "DT_FLOAT"}}}, {"name": "model/ExpandDims", "op": "ExpandDims", "input": ["model/Placeholder", "model/ExpandDims/dim"], "attr": {"Tdim": {"type": "DT_INT32"}, "T": {"type": "DT_FLOAT"}}}, {"name": "model/batch_normalization/FusedBatchNormV3/Mul", "op": "Mul", "input": ["model/ExpandDims", "model/batch_normalization/FusedBatchNormV3/Scaled"], "attr": {"T": {"type": "DT_FLOAT"}}}, {"name": "model/batch_normalization/FusedBatchNormV3", "op": "Add", "input": ["model/batch_normalization/FusedBatchNormV3/Mul", "model/batch_normalization/FusedBatchNormV3/Offset"], "attr": {"T": {"type": "DT_FLOAT"}}}, {"name": "model/conv2d_2/Relu", "op": "_FusedConv2D", "input": ["model/batch_normalization/FusedBatchNormV3", "conv2d_2/kernel", "conv2d_2/bias"], "device": "/device:CPU:0", "attr": {"padding": {"s": "U0FNRQ=="}, "epsilon": {"f": 0.0}, "T": {"type": "DT_FLOAT"}, "explicit_paddings": {"list": {}}, "num_args": {"i": "1"}, "strides": {"list": {"i": ["1", "1", "1", "1"]}}, "use_cudnn_on_gpu": {"b": true}, "fused_ops": {"list": {"s": ["Qmlhc0FkZA==", "UmVsdQ=="]}}, "dilations": {"list": {"i": ["1", "1", "1", "1"]}}, "data_format": {"s": "TkhXQw=="}}}, {"name": "model/conv2d_3/Relu", "op": "_FusedConv2D", "input": ["model/batch_normalization/FusedBatchNormV3", "conv2d_3/kernel", "conv2d_3/bias"], "device": "/device:CPU:0", "attr": {"dilations": {"list": {"i": ["1", "1", "1", "1"]}}, "strides": {"list": {"i": ["1", "1", "1", "1"]}}, "fused_ops": {"list": {"s": ["Qmlhc0FkZA==", "UmVsdQ=="]}}, "num_args": {"i": "1"}, "explicit_paddings": {"list": {}}, "use_cudnn_on_gpu": {"b": true}, "epsilon": {"f": 0.0}, "data_format": {"s": "TkhXQw=="}, "padding": {"s": "U0FNRQ=="}, "T": {"type": "DT_FLOAT"}}}, {"name": "model/conv2d_4/Relu", "op": "_FusedConv2D", "input": ["model/batch_normalization/FusedBatchNormV3", "conv2d_4/kernel", "conv2d_4/bias"], "device": "/device:CPU:0", "attr": {"padding": {"s": "U0FNRQ=="}, "num_args": {"i": "1"}, "T": {"type": "DT_FLOAT"}, "epsilon": {"f": 0.0}, "explicit_paddings": {"list": {}}, "dilations": {"list": {"i": ["1", "1", "1", "1"]}}, "use_cudnn_on_gpu": {"b": true}, "strides": {"list": {"i": ["1", "1", "1", "1"]}}, "data_format": {"s": "TkhXQw=="}, "fused_ops": {"list": {"s": ["Qmlhc0FkZA==", "UmVsdQ=="]}}}}, {"name": "model/Pad", "op": "Pad", "input": ["model/batch_normalization/FusedBatchNormV3", "model/Pad_3/paddings"], "attr": {"Tpaddings": {"type": "DT_INT32"}, "T": {"type": "DT_FLOAT"}}}, {"name": "model/batch_normalization_3/FusedBatchNormV3/Mul", "op": "Mul", "input": ["model/batch_normalization_3/FusedBatchNormV3/Scaled", "model/conv2d_2/Relu"], "attr": {"T": {"type": "DT_FLOAT"}}}, {"name": "model/batch_normalization_4/FusedBatchNormV3/Mul", "op": "Mul", "input": ["model/batch_normalization_4/FusedBatchNormV3/Scaled", "model/conv2d_3/Relu"], "attr": {"T": {"type": "DT_FLOAT"}}}, {"name": "model/batch_normalization_5/FusedBatchNormV3/Mul", "op": "Mul", "input": ["model/batch_normalization_5/FusedBatchNormV3/Scaled", "model/conv2d_4/Relu"], "attr": {"T": {"type": "DT_FLOAT"}}}, {"name": "model/conv2d/Relu", "op": "_FusedConv2D", "input": ["model/Pad", "conv2d/kernel", "conv2d/bias"], "device": "/device:CPU:0", "attr": {"num_args": {"i": "1"}, "T": {"type": "DT_FLOAT"}, "epsilon": {"f": 0.0}, "strides": {"list": {"i": ["1", "1", "1", "1"]}}, "padding": {"s": "VkFMSUQ="}, "fused_ops": {"list": {"s": ["Qmlhc0FkZA==", "UmVsdQ=="]}}, "dilations": {"list": {"i": ["1", "1", "1", "1"]}}, "explicit_paddings": {"list": {}}, "data_format": {"s": "TkhXQw=="}, "use_cudnn_on_gpu": {"b": true}}}, {"name": "model/conv2d_1/Relu", "op": "_FusedConv2D", "input": ["model/Pad", "conv2d_1/kernel", "conv2d_1/bias"], "device": "/device:CPU:0", "attr": {"data_format": {"s": "TkhXQw=="}, "T": {"type": "DT_FLOAT"}, "fused_ops": {"list": {"s": ["Qmlhc0FkZA==", "UmVsdQ=="]}}, "strides": {"list": {"i": ["1", "1", "1", "1"]}}, "explicit_paddings": {"list": {}}, "padding": {"s": "VkFMSUQ="}, "use_cudnn_on_gpu": {"b": true}, "dilations": {"list": {"i": ["1", "1", "1", "1"]}}, "epsilon": {"f": 0.0}, "num_args": {"i": "1"}}}, {"name": "model/batch_normalization_3/FusedBatchNormV3", "op": "Add", "input": ["model/batch_normalization_3/FusedBatchNormV3/Mul", "model/batch_normalization_3/FusedBatchNormV3/Offset"], "attr": {"T": {"type": "DT_FLOAT"}}}, {"name": "model/batch_normalization_4/FusedBatchNormV3", "op": "Add", "input": ["model/batch_normalization_4/FusedBatchNormV3/Mul", "model/batch_normalization_4/FusedBatchNormV3/Offset"], "attr": {"T": {"type": "DT_FLOAT"}}}, {"name": "model/batch_normalization_5/FusedBatchNormV3", "op": "Add", "input": ["model/batch_normalization_5/FusedBatchNormV3/Mul", "model/batch_normalization_5/FusedBatchNormV3/Offset"], "attr": {"T": {"type": "DT_FLOAT"}}}, {"name": "model/batch_normalization_1/FusedBatchNormV3/Mul", "op": "Mul", "input": ["model/batch_normalization_1/FusedBatchNormV3/Scaled", "model/conv2d/Relu"], "attr": {"T": {"type": "DT_FLOAT"}}}, {"name": "model/batch_normalization_2/FusedBatchNormV3/Mul", "op": "Mul", "input": ["model/batch_normalization_2/FusedBatchNormV3/Scaled", "model/conv2d_1/Relu"], "attr": {"T": {"type": "DT_FLOAT"}}}, {"name": "model/max_pooling2d_2/MaxPool", "op": "MaxPool", "input": ["model/batch_normalization_3/FusedBatchNormV3"], "attr": {"ksize": {"list": {"i": ["1", "1", "96", "1"]}}, "strides": {"list": {"i": ["1", "1", "96", "1"]}}, "data_format": {"s": "TkhXQw=="}, "padding": {"s": "VkFMSUQ="}, "T": {"type": "DT_FLOAT"}}}, {"name": "model/max_pooling2d_3/MaxPool", "op": "MaxPool", "input": ["model/batch_normalization_4/FusedBatchNormV3"], "attr": {"padding": {"s": "VkFMSUQ="}, "T": {"type": "DT_FLOAT"}, "data_format": {"s": "TkhXQw=="}, "strides": {"list": {"i": ["1", "1", "96", "1"]}}, "ksize": {"list": {"i": ["1", "1", "96", "1"]}}}}, {"name": "model/max_pooling2d_4/MaxPool", "op": "MaxPool", "input": ["model/batch_normalization_5/FusedBatchNormV3"], "attr": {"ksize": {"list": {"i": ["1", "1", "96", "1"]}}, "data_format": {"s": "TkhXQw=="}, "padding": {"s": "VkFMSUQ="}, "T": {"type": "DT_FLOAT"}, "strides": {"list": {"i": ["1", "1", "96", "1"]}}}}, {"name": "model/batch_normalization_1/FusedBatchNormV3", "op": "Add", "input": ["model/batch_normalization_1/FusedBatchNormV3/Mul", "model/batch_normalization_1/FusedBatchNormV3/Offset"], "attr": {"T": {"type": "DT_FLOAT"}}}, {"name": "model/batch_normalization_2/FusedBatchNormV3", "op": "Add", "input": ["model/batch_normalization_2/FusedBatchNormV3/Mul", "model/batch_normalization_2/FusedBatchNormV3/Offset"], "attr": {"T": {"type": "DT_FLOAT"}}}, {"name": "model/Squeeze_2", "op": "Squeeze", "input": ["model/max_pooling2d_2/MaxPool"], "attr": {"squeeze_dims": {"list": {"i": ["2"]}}, "T": {"type": "DT_FLOAT"}}}, {"name": "model/Squeeze_3", "op": "Squeeze", "input": ["model/max_pooling2d_3/MaxPool"], "attr": {"T": {"type": "DT_FLOAT"}, "squeeze_dims": {"list": {"i": ["2"]}}}}, {"name": "model/Squeeze_4", "op": "Squeeze", "input": ["model/max_pooling2d_4/MaxPool"], "attr": {"T": {"type": "DT_FLOAT"}, "squeeze_dims": {"list": {"i": ["2"]}}}}, {"name": "model/max_pooling2d/MaxPool", "op": "MaxPool", "input": ["model/batch_normalization_1/FusedBatchNormV3"], "attr": {"data_format": {"s": "TkhXQw=="}, "strides": {"list": {"i": ["1", "1", "59", "1"]}}, "ksize": {"list": {"i": ["1", "1", "59", "1"]}}, "T": {"type": "DT_FLOAT"}, "padding": {"s": "VkFMSUQ="}}}, {"name": "model/max_pooling2d_1/MaxPool", "op": "MaxPool", "input": ["model/batch_normalization_2/FusedBatchNormV3"], "attr": {"strides": {"list": {"i": ["1", "1", "30", "1"]}}, "data_format": {"s": "TkhXQw=="}, "padding": {"s": "VkFMSUQ="}, "ksize": {"list": {"i": ["1", "1", "30", "1"]}}, "T": {"type": "DT_FLOAT"}}}, {"name": "model/Squeeze", "op": "Squeeze", "input": ["model/max_pooling2d/MaxPool"], "attr": {"squeeze_dims": {"list": {"i": ["2"]}}, "T": {"type": "DT_FLOAT"}}}, {"name": "model/Squeeze_1", "op": "Squeeze", "input": ["model/max_pooling2d_1/MaxPool"], "attr": {"squeeze_dims": {"list": {"i": ["2"]}}, "T": {"type": "DT_FLOAT"}}}, {"name": "model/concat", "op": "ConcatV2", "input": ["model/Squeeze", "model/Squeeze_1", "model/Squeeze_2", "model/Squeeze_3", "model/Squeeze_4", "model/concat/axis"], "attr": {"Tidx": {"type": "DT_INT32"}, "N": {"i": "5"}, "T": {"type": "DT_FLOAT"}}}, {"name": "model/ExpandDims_1", "op": "ExpandDims", "input": ["model/concat", "model/ExpandDims/dim"], "attr": {"T": {"type": "DT_FLOAT"}, "Tdim": {"type": "DT_INT32"}}}, {"name": "model/Pad_1", "op": "Pad", "input": ["model/ExpandDims_1", "model/Pad_3/paddings"], "attr": {"Tpaddings": {"type": "DT_INT32"}, "T": {"type": "DT_FLOAT"}}}, {"name": "model/conv2d_5/Relu", "op": "_FusedConv2D", "input": ["model/Pad_1", "conv2d_5/kernel", "conv2d_5/bias"], "device": "/device:CPU:0", "attr": {"use_cudnn_on_gpu": {"b": true}, "explicit_paddings": {"list": {}}, "padding": {"s": "VkFMSUQ="}, "dilations": {"list": {"i": ["1", "1", "1", "1"]}}, "fused_ops": {"list": {"s": ["Qmlhc0FkZA==", "UmVsdQ=="]}}, "data_format": {"s": "TkhXQw=="}, "strides": {"list": {"i": ["1", "1", "1", "1"]}}, "T": {"type": "DT_FLOAT"}, "epsilon": {"f": 0.0}, "num_args": {"i": "1"}}}, {"name": "model/batch_normalization_6/FusedBatchNormV3/Mul", "op": "Mul", "input": ["model/batch_normalization_6/FusedBatchNormV3/Scaled", "model/conv2d_5/Relu"], "attr": {"T": {"type": "DT_FLOAT"}}}, {"name": "model/batch_normalization_6/FusedBatchNormV3", "op": "Add", "input": ["model/batch_normalization_6/FusedBatchNormV3/Mul", "model/batch_normalization_6/FusedBatchNormV3/Offset"], "attr": {"T": {"type": "DT_FLOAT"}}}, {"name": "model/transpose", "op": "Transpose", "input": ["model/batch_normalization_6/FusedBatchNormV3", "model/transpose_2/perm"], "attr": {"Tperm": {"type": "DT_INT32"}, "T": {"type": "DT_FLOAT"}}}, {"name": "model/Pad_2", "op": "Pad", "input": ["model/transpose", "model/Pad_3/paddings"], "attr": {"Tpaddings": {"type": "DT_INT32"}, "T": {"type": "DT_FLOAT"}}}, {"name": "model/conv2d_6/Relu", "op": "_FusedConv2D", "input": ["model/Pad_2", "conv2d_6/kernel", "conv2d_6/bias"], "device": "/device:CPU:0", "attr": {"T": {"type": "DT_FLOAT"}, "use_cudnn_on_gpu": {"b": true}, "epsilon": {"f": 0.0}, "data_format": {"s": "TkhXQw=="}, "num_args": {"i": "1"}, "fused_ops": {"list": {"s": ["Qmlhc0FkZA==", "UmVsdQ=="]}}, "strides": {"list": {"i": ["1", "1", "1", "1"]}}, "padding": {"s": "VkFMSUQ="}, "dilations": {"list": {"i": ["1", "1", "1", "1"]}}, "explicit_paddings": {"list": {}}}}, {"name": "model/batch_normalization_7/FusedBatchNormV3/Mul", "op": "Mul", "input": ["model/batch_normalization_7/FusedBatchNormV3/Scaled", "model/conv2d_6/Relu"], "attr": {"T": {"type": "DT_FLOAT"}}}, {"name": "model/batch_normalization_7/FusedBatchNormV3", "op": "Add", "input": ["model/batch_normalization_7/FusedBatchNormV3/Mul", "model/batch_normalization_7/FusedBatchNormV3/Offset"], "attr": {"T": {"type": "DT_FLOAT"}}}, {"name": "model/transpose_1", "op": "Transpose", "input": ["model/batch_normalization_7/FusedBatchNormV3", "model/transpose_2/perm"], "attr": {"T": {"type": "DT_FLOAT"}, "Tperm": {"type": "DT_INT32"}}}, {"name": "model/Add", "op": "Add", "input": ["model/transpose", "model/transpose_1"], "attr": {"T": {"type": "DT_FLOAT"}}}, {"name": "model/Pad_3", "op": "Pad", "input": ["model/Add", "model/Pad_3/paddings"], "attr": {"T": {"type": "DT_FLOAT"}, "Tpaddings": {"type": "DT_INT32"}}}, {"name": "model/conv2d_7/Relu", "op": "_FusedConv2D", "input": ["model/Pad_3", "conv2d_7/kernel", "conv2d_7/bias"], "device": "/device:CPU:0", "attr": {"epsilon": {"f": 0.0}, "fused_ops": {"list": {"s": ["Qmlhc0FkZA==", "UmVsdQ=="]}}, "T": {"type": "DT_FLOAT"}, "data_format": {"s": "TkhXQw=="}, "num_args": {"i": "1"}, "use_cudnn_on_gpu": {"b": true}, "strides": {"list": {"i": ["1", "1", "1", "1"]}}, "explicit_paddings": {"list": {}}, "dilations": {"list": {"i": ["1", "1", "1", "1"]}}, "padding": {"s": "VkFMSUQ="}}}, {"name": "model/batch_normalization_8/FusedBatchNormV3/Mul", "op": "Mul", "input": ["model/batch_normalization_8/FusedBatchNormV3/Scaled", "model/conv2d_7/Relu"], "attr": {"T": {"type": "DT_FLOAT"}}}, {"name": "model/batch_normalization_8/FusedBatchNormV3", "op": "Add", "input": ["model/batch_normalization_8/FusedBatchNormV3/Mul", "model/batch_normalization_8/FusedBatchNormV3/Offset"], "attr": {"T": {"type": "DT_FLOAT"}}}, {"name": "model/transpose_2", "op": "Transpose", "input": ["model/batch_normalization_8/FusedBatchNormV3", "model/transpose_2/perm"], "attr": {"T": {"type": "DT_FLOAT"}, "Tperm": {"type": "DT_INT32"}}}, {"name": "model/Add_1", "op": "Add", "input": ["model/Add", "model/transpose_2"], "attr": {"T": {"type": "DT_FLOAT"}}}, {"name": "model/concat_1", "op": "ConcatV2", "input": ["model/ExpandDims_1", "model/transpose", "model/Add", "model/Add_1", "model/concat/axis"], "attr": {"T": {"type": "DT_FLOAT"}, "Tidx": {"type": "DT_INT32"}, "N": {"i": "4"}}}, {"name": "model/Max", "op": "Max", "input": ["model/concat_1", "model/Max/reduction_indices"], "attr": {"keep_dims": {"b": false}, "Tidx": {"type": "DT_INT32"}, "T": {"type": "DT_FLOAT"}}}, {"name": "model/moments/mean", "op": "Mean", "input": ["model/concat_1", "model/moments/mean/reduction_indices"], "attr": {"T": {"type": "DT_FLOAT"}, "keep_dims": {"b": true}, "Tidx": {"type": "DT_INT32"}}}, {"name": "model/moments/Squeeze", "op": "Squeeze", "input": ["model/moments/mean"], "attr": {"T": {"type": "DT_FLOAT"}, "squeeze_dims": {"list": {"i": ["1"]}}}}, {"name": "model/concat_2", "op": "ConcatV2", "input": ["model/Max", "model/moments/Squeeze", "model/concat/axis"], "attr": {"N": {"i": "2"}, "T": {"type": "DT_FLOAT"}, "Tidx": {"type": "DT_INT32"}}}, {"name": "model/flatten/Shape", "op": "Shape", "input": ["model/concat_2"], "attr": {"T": {"type": "DT_FLOAT"}, "out_type": {"type": "DT_INT32"}}}, {"name": "model/flatten/strided_slice", "op": "StridedSlice", "input": ["model/flatten/Shape", "model/flatten/strided_slice/stack", "model/moments/mean/reduction_indices", "model/moments/mean/reduction_indices"], "attr": {"ellipsis_mask": {"i": "0"}, "Index": {"type": "DT_INT32"}, "new_axis_mask": {"i": "0"}, "T": {"type": "DT_INT32"}, "begin_mask": {"i": "0"}, "shrink_axis_mask": {"i": "1"}, "end_mask": {"i": "0"}}}, {"name": "model/flatten/Reshape/shape", "op": "Pack", "input": ["model/flatten/strided_slice", "model/flatten/Reshape/shape/1"], "attr": {"T": {"type": "DT_INT32"}, "axis": {"i": "0"}, "N": {"i": "2"}}}, {"name": "model/flatten/Reshape", "op": "Reshape", "input": ["model/concat_2", "model/flatten/Reshape/shape"], "attr": {"T": {"type": "DT_FLOAT"}, "Tshape": {"type": "DT_INT32"}}}, {"name": "model/batch_normalization_9/batchnorm/mul_1", "op": "Mul", "input": ["model/batch_normalization_9/batchnorm/mul", "model/flatten/Reshape"], "attr": {"T": {"type": "DT_FLOAT"}}}, {"name": "model/batch_normalization_9/batchnorm/add_1", "op": "AddV2", "input": ["model/batch_normalization_9/batchnorm/mul_1", "model/batch_normalization_9/batchnorm/sub"], "attr": {"T": {"type": "DT_FLOAT"}}}, {"name": "model/dense/Relu", "op": "_FusedMatMul", "input": ["model/batch_normalization_9/batchnorm/add_1", "dense/kernel", "dense/bias"], "device": "/device:CPU:0", "attr": {"transpose_b": {"b": false}, "transpose_a": {"b": false}, "epsilon": {"f": 0.0}, "num_args": {"i": "1"}, "T": {"type": "DT_FLOAT"}, "fused_ops": {"list": {"s": ["Qmlhc0FkZA==", "UmVsdQ=="]}}}}, {"name": "model/batch_normalization_10/batchnorm/mul_1", "op": "Mul", "input": ["model/batch_normalization_10/batchnorm/mul", "model/dense/Relu"], "attr": {"T": {"type": "DT_FLOAT"}}}, {"name": "model/batch_normalization_10/batchnorm/add_1", "op": "AddV2", "input": ["model/batch_normalization_10/batchnorm/mul_1", "model/batch_normalization_10/batchnorm/sub"], "attr": {"T": {"type": "DT_FLOAT"}}}, {"name": "model/dense_1/Relu", "op": "_FusedMatMul", "input": ["model/batch_normalization_10/batchnorm/add_1", "dense_1/kernel", "dense_1/bias"], "device": "/device:CPU:0", "attr": {"num_args": {"i": "1"}, "fused_ops": {"list": {"s": ["Qmlhc0FkZA==", "UmVsdQ=="]}}, "transpose_b": {"b": false}, "epsilon": {"f": 0.0}, "T": {"type": "DT_FLOAT"}, "transpose_a": {"b": false}}}, {"name": "model/dense_2/BiasAdd", "op": "_FusedMatMul", "input": ["model/dense_1/Relu", "dense_2/kernel", "dense_2/bias"], "device": "/device:CPU:0", "attr": {"T": {"type": "DT_FLOAT"}, "fused_ops": {"list": {"s": ["Qmlhc0FkZA=="]}}, "transpose_a": {"b": false}, "transpose_b": {"b": false}, "num_args": {"i": "1"}, "epsilon": {"f": 0.0}}}, {"name": "model/Sigmoid", "op": "Sigmoid", "input": ["model/dense_2/BiasAdd"], "attr": {"T": {"type": "DT_FLOAT"}}}], "versions": {}}, "weightsManifest": [{"paths": ["group1-shard1of1.bin"], "weights": [{"name": "model/batch_normalization_10/batchnorm/mul", "shape": [200], "dtype": "float32"}, {"name": "model/batch_normalization_9/batchnorm/mul", "shape": [1506], "dtype": "float32"}, {"name": "model/Max/reduction_indices", "shape": [], "dtype": "int32"}, {"name": "conv2d/kernel", "shape": [7, 38, 1, 204], "dtype": "float32"}, {"name": "conv2d/bias", "shape": [204], "dtype": "float32"}, {"name": "conv2d_1/kernel", "shape": [7, 67, 1, 204], "dtype": "float32"}, {"name": "conv2d_1/bias", "shape": [204], "dtype": "float32"}, {"name": "conv2d_2/kernel", "shape": [128, 1, 1, 51], "dtype": "float32"}, {"name": "conv2d_2/bias", "shape": [51], "dtype": "float32"}, {"name": "conv2d_3/kernel", "shape": [64, 1, 1, 51], "dtype": "float32"}, {"name": "conv2d_3/bias", "shape": [51], "dtype": "float32"}, {"name": "conv2d_4/kernel", "shape": [32, 1, 1, 51], "dtype": "float32"}, {"name": "conv2d_4/bias", "shape": [51], "dtype": "float32"}, {"name": "model/ExpandDims/dim", "shape": [], "dtype": "int32"}, {"name": "model/batch_normalization_4/FusedBatchNormV3/Scaled", "shape": [51], "dtype": "float32"}, {"name": "conv2d_5/kernel", "shape": [7, 561, 1, 64], "dtype": "float32"}, {"name": "conv2d_5/bias", "shape": [64], "dtype": "float32"}, {"name": "conv2d_6/kernel", "shape": [7, 64, 1, 64], "dtype": "float32"}, {"name": "conv2d_6/bias", "shape": [64], "dtype": "float32"}, {"name": "model/Pad_3/paddings", "shape": [4, 2], "dtype": "int32"}, {"name": "model/batch_normalization_4/FusedBatchNormV3/Offset", "shape": [51], "dtype": "float32"}, {"name": "conv2d_7/kernel", "shape": [7, 64, 1, 64], "dtype": "float32"}, {"name": "conv2d_7/bias", "shape": [64], "dtype": "float32"}, {"name": "model/transpose_2/perm", "shape": [4], "dtype": "int32"}, {"name": "model/concat/axis", "shape": [], "dtype": "int32"}, {"name": "model/batch_normalization_3/FusedBatchNormV3/Scaled", "shape": [51], "dtype": "float32"}, {"name": "model/batch_normalization_3/FusedBatchNormV3/Offset", "shape": [51], "dtype": "float32"}, {"name": "model/flatten/strided_slice/stack", "shape": [1], "dtype": "int32"}, {"name": "model/moments/mean/reduction_indices", "shape": [1], "dtype": "int32"}, {"name": "model/flatten/Reshape/shape/1", "shape": [], "dtype": "int32"}, {"name": "model/batch_normalization_9/batchnorm/sub", "shape": [1506], "dtype": "float32"}, {"name": "dense/kernel", "shape": [1506, 200], "dtype": "float32"}, {"name": "dense/bias", "shape": [200], "dtype": "float32"}, {"name": "model/batch_normalization/FusedBatchNormV3/Scaled", "shape": [1], "dtype": "float32"}, {"name": "model/batch_normalization_10/batchnorm/sub", "shape": [200], "dtype": "float32"}, {"name": "dense_1/kernel", "shape": [200, 100], "dtype": "float32"}, {"name": "dense_1/bias", "shape": [100], "dtype": "float32"}, {"name": "dense_2/kernel", "shape": [100, 2], "dtype": "float32"}, {"name": "model/batch_normalization/FusedBatchNormV3/Offset", "shape": [1], "dtype": "float32"}, {"name": "dense_2/bias", "shape": [2], "dtype": "float32"}, {"name": "model/batch_normalization_8/FusedBatchNormV3/Scaled", "shape": [64], "dtype": "float32"}, {"name": "model/batch_normalization_8/FusedBatchNormV3/Offset", "shape": [64], "dtype": "float32"}, {"name": "model/batch_normalization_7/FusedBatchNormV3/Scaled", "shape": [64], "dtype": "float32"}, {"name": "model/batch_normalization_7/FusedBatchNormV3/Offset", "shape": [64], "dtype": "float32"}, {"name": "model/batch_normalization_6/FusedBatchNormV3/Scaled", "shape": [64], "dtype": "float32"}, {"name": "model/batch_normalization_6/FusedBatchNormV3/Offset", "shape": [64], "dtype": "float32"}, {"name": "model/batch_normalization_2/FusedBatchNormV3/Scaled", "shape": [204], "dtype": "float32"}, {"name": "model/batch_normalization_2/FusedBatchNormV3/Offset", "shape": [204], "dtype": "float32"}, {"name": "model/batch_normalization_1/FusedBatchNormV3/Scaled", "shape": [204], "dtype": "float32"}, {"name": "model/batch_normalization_1/FusedBatchNormV3/Offset", "shape": [204], "dtype": "float32"}, {"name": "model/batch_normalization_5/FusedBatchNormV3/Scaled", "shape": [51], "dtype": "float32"}, {"name": "model/batch_normalization_5/FusedBatchNormV3/Offset", "shape": [51], "dtype": "float32"}]}]}